# 3. The Neighbor

Target
- the phone number of a person

Clues
- he was a Cancer born in the year of the Rabbit
- ( cancer: June 22 to about July 22 )
- ( rabbit: 1903 ~ year % 4 == 3 )

In [1]:
import pandas as pd
NC = pd.read_csv('noahs-customers.csv')
NC[['name','phone','birthdate']].head()

                    name         phone   birthdate
0     Jacqueline Alvarez  315-377-5031  1958-01-23
1           Julie Howell  680-537-8725  1956-12-03
2        Christopher Ali  315-846-6054  2001-09-20
3  Christopher Rodriguez  516-275-2292  1959-07-10
4      Jeffrey Wilkinson  838-830-6960  1988-09-08

In [2]:
def is_cancer_of_rabbit(date):
    year, month, day = date.split('-')
    if int(year) % 4 == 3 and\
    ((month == '06' and 22<=int(day)<=30) or\
    (month == '07' and 1<=int(day)<=22)):
        return True
    return False
NC = NC[NC['birthdate'].apply(lambda x: is_cancer_of_rabbit(x))]
NC.head(),len(NC)

(     customerid                   name              address  \
 3          1004  Christopher Rodriguez    102 Mount Hope Pl
 12         1013           Kevin Watson        1060A 39th St
 17         1018           Carmen Smith  1843A E Tremont Ave
 46         1047          Tammy Houston       4148 N Park Pl
 205        1206        Sarah Hernandez         986 10th Way

               citystatezip   birthdate         phone          timezone  \
 3          Bronx, NY 10453  1959-07-10  516-275-2292  America/New_York
 12      Brooklyn, NY 11219  1995-07-04  838-625-4866  America/New_York
 17         Bronx, NY 10460  1955-06-29  315-795-3014  America/New_York
 46     Cleveland, OH 44111  1999-07-04  216-937-0321  America/New_York
 205  San Antonio, TX 78257  1951-06-26  682-287-2999   America/Chicago

           lat      long
 3    40.84939 -73.90916
 12   40.64326 -73.99460
 17   40.84061 -73.88576
 46   41.47640 -81.68050
 205  29.46320 -98.52380  ,
 181)

In [3]:
def is_jamaica(city):
    return city.startswith('Jamaica') and city.split()[-1] == '11435'
# NC.citystatezip.head()
NC = NC[NC['citystatezip'].apply(lambda x: is_jamaica(x))]
NC

# should be Robert Morton

,customerid,name,address,citystatezip,birthdate,phone,timezone,lat,long
1549,2550,Robert Morton,145-51 107th Ave,"Jamaica, NY 11435",1999-07-08,917-288-9635,America/New_York,40.68959,-73.80487